xsession/hal_wch/source/ARM/CH32F203/NoneOS/CH32F203xx.svd
        <register>
          <name>PADDR11</name>
          <displayName>PADDR11</displayName>
          <description>DMA channel 11 peripheral address
          register used in ch32F20x_D8/D8C</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MADDR11</name>
          <displayName>MADDR11</displayName>
          <description>DMA channel 11 memory address
          register used in ch32F20x_D8/D8C</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>	
		<register>
          <name>EXTEN_INTFR</name>
          <displayName>INTFR</displayName>
          <description>DMA2 EXTEN interrupt status register
          (DMA_INTFR)used in ch32F20x_D8/D8C</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GIF8</name>
              <description>Channel 8 Global interrupt
              flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF8</name>
              <description>Channel 8 Transfer Complete
              flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIF8</name>
              <description>Channel 8 Half Transfer Complete
              flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIF8</name>
              <description>Channel 8 Transfer Error
              flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF9</name>
              <description>Channel 9 Global interrupt
              flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF9</name>
              <description>Channel 9 Transfer Complete
              flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIF9</name>
              <description>Channel 9 Half Transfer Complete
              flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIF9</name>
              <description>Channel 9 Transfer Error
              flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF10</name>
              <description>Channel 10 Global interrupt
              flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF10</name>
              <description>Channel 10 Transfer Complete
              flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIF10</name>
              <description>Channel 10 Half Transfer Complete
              flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIF10</name>
              <description>Channel 10 Transfer Error
              flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GIF11</name>
              <description>Channel 11 Global interrupt
              flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF11</name>
              <description>Channel 11 Transfer Complete
              flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTIF11</name>
              <description>Channel 11 Half Transfer Complete
              flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIF11</name>
              <description>Channel 11 Transfer Error
              flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			</fields>
		</register>
		<register>
          <name>EXTEN_INTFCR</name>
          <displayName>INTFCR</displayName>
          <description>DMA2 EXTEN interrupt flag clear register
          (DMA_INTFCR)used in ch32F20x_D8/D8C</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <access>write-read</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CGIF8</name>
              <description>Channel 8 Global interrupt
              clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CGIF9</name>
              <description>Channel 9 Global interrupt
              clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CGIF10</name>
              <description>Channel 10 Global interrupt
              clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CGIF11</name>
              <description>Channel 11 Global interrupt
              clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			
			<field>
              <name>CTCIF8</name>
              <description>Channel 8 Global interrupt
              clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>CTCIF9</name>
              <description>Channel 9 Global interrupt
              clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>CTCIF10</name>
              <description>Channel 10 Global interrupt
              clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>CTCIF11</name>
              <description>Channel 11 Global interrupt
              clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			
			
			<field>
              <name>CHTIF8</name>
              <description>Channel 8 Global interrupt
              clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>CHTIF9</name>
              <description>Channel 9 Global interrupt
              clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>CHTIF10</name>
              <description>Channel 10 Global interrupt
              clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>CHTIF11</name>
              <description>Channel 11 Global interrupt
              clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			
			
			<field>
              <name>CTEIF8</name>
              <description>Channel 8 Global interrupt
              clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>CTEIF9</name>
              <description>Channel 9 Global interrupt
              clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>CTEIF10</name>
              <description>Channel 10 Global interrupt
              clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>CTEIF11</name>
              <description>Channel 11 Global interrupt
              clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			
			
			</fields>
		</register>
